{"/_index_old/":{"data":{"about-this-site#About this site":"This website is intended to serve as a reference for all things PV Creations. It’s going to be quite detailed, containing tidbits about a lot of things that wouldn’t fit elsewhere.","feedback#Feedback":"Questions? Comments? Want to report an issue with the site? Feel free to leave your feedback in the PVC Discord server. Some of you are way better at this than I am! Alternatively, you can send your feedback to pv.creations.rbx@gmail.com.","supporting-pv-creations#Supporting PV Creations":"If you appreciate PV Creations’ work, please consider donating!\nDonate via Ko-fi\rIf you are unable to donate, simply using PVC assets and spreading the word helps a lot!","thanks#Thanks":"Luke Smith, some guy who went on a lengthy tirade about modern web bloat Simple Icons for the Roblox, Ko-fi, Linktree, Bluesky and Google Drive icons used","welcome-to-pv-creations#Welcome to PV Creations":"Welcome to PV Creations This site is a work in progress! See the new home page here (work in progress)."},"title":"_index_old"},"/about/":{"data":{"":"","about-pv-creations#About PV Creations":"PV Creations was created in June 2021 as a centralized location for all Roblox assets created by PenguinvilleRescue1. After a while, it ended up morphing into something a little bit more.\nFrom 2025, PV Creations gradually began shifting away from Roblox assets and began producing mods for Euro Truck Simulator 2 and American Truck Simulator.","about-the-website#About the website":"This website is intended to serve as a reference for all things PV Creations. It intends to be as comprehensive as possible, containing information that wouldn’t fit elsewhere.\nPlease be aware that the site is a work in progress. This means that the site may have issues!","contact-us#Contact us":"If you notice any issues or just have general feedback, we’d love to hear from you. You can do so through the following means:\nRaise an issue on GitHub\rPV Creations on Roblox\rPV Creations on Discord\rEmail PV Creations","supporting-pv-creations#Supporting PV Creations":"If you appreciate PV Creations’ work, please consider donating!\nDonate via Ko-fi\rIf you are unable to donate for whatever reason, simply using PVC assets and spreading the word helps a lot!","thanks#Thanks":"Luke Smith, some guy who went on a lengthy tirade about modern web bloat Simple Icons for the Roblox, Ko-fi, Linktree, Bluesky, Steam and Google Drive icons used"},"title":"About"},"/blog/a/":{"data":{"":"","test-blog#Test blog":"This is a test blog post"},"title":"Hell:"},"/blog/modsupdate-251118/":{"data":{"":"Due to a Cloudflare outage, my mods hosted on TruckyMods will be unavailable for the time being.\nNote to self: don’t put all your eggs in one basket."},"title":"TruckyMods update"},"/blog/rebrand/":{"data":{"":"A rebrand was long overdue.\nBut first, here’s the backstory of the original PV Creations logo.","the-new-logo#The new logo":"Most importantly PV Creations’ new logo isn’t too different from the original, but I made a few changes:\nTypeface: Agency FB replaces Poppins as the PVC logo’s font. A condensed font (at least on Windows), Agency FB takes up more vertical space within the circle, making the logo more visually appealing and – in my opinion, at least – proportional. …and that’s about it. It’s already live as the Discord server’s icon and will be rolled out to other PVC outlets in due course. Let me know what you think in the Discord server!","the-original-logo#The original logo":"I created PV Creations’ original logo in 2021 on an app called Vectornator (now known as Linearity Curve). The logo comprises the letters “PVC” enclosed in a circle. The logo received a few tweaks over the years, but its fundamanetals remained unchanged. I originally intended that the logo was change color over time, but this was quickly abandoned and the original purple gradient stuck. This was later changed to a solid purple envisaged as an “in-between” of the two.\nThe original logo was never available in SVG format, not because of some technical limitation, but because 1. I didn’t know how to edit SVG files using a text editor (doesn’t help that TextEdit sucks) and 2. I never thought I’d need one.\nAt the end of 2023 I got a “new” Windows PC. Unfortunately Linearity Curve is only available for the iPad and Mac. I don’t have an iPad, and my Mac had become unbearably slow. I never took the opportunity to vectorize it, although I probably should’ve."},"title":"Rebrand"},"/blog/tsupdate-155/":{"data":{"":"It appears that all currently supported mods for Euro Truck Simulator 2 and American Truck Simulator work without issues with the 1.55 update.\nYou can see all mods here."},"title":"ETS2/ATS Mod Status (1.55)"},"/blog/tsupdate-156/":{"data":{"":"Long overdue, but it appears that all currently supported mods for Euro Truck Simulator 2 and American Truck Simulator work without issues with the 1.56 update.\nAn undocumented change with 1.56 was that FMOD was updated from version 2.02.25 to 2.03.09. A select few sound mods may be impacted by this change. I haven’t produced any, but others have, so check with them to see if they need updating.\nYou can see all mods here."},"title":"ETS2/ATS Mod Status (1.56)"},"/blog/tsupdate-157/":{"data":{"":"I wrote the last update because I was going to be on vacation the week following, leaving me unable to update any mods.\nIt appears that all currently supported mods for Euro Truck Simulator 2 and American Truck Simulator work without issues with the 1.57 update.\nYou can see all mods here."},"title":"ETS2/ATS Mod Status (1.57)"},"/blog/tsupdate-157ob/":{"data":{"":"I’m not sure if any mods need updating at the moment – probably not. At the time I’m writing this, I’m currently downloading the open beta for ETS2 1.57.\nDepending on how this update affects the Scania R and S Quick Job trucks, which were updated with this version, ETS2-QJTI may receive an update related to them. ETS2-QJTI never affected these trucks, so the current version should still work with 1.57.\nYou can see all mods here."},"title":"ETS2 Mod Status (1.57 Open Beta)"},"/blog/tsupdate-158/":{"data":{"":"Since ATS 1.58 came out yesterday and ETS2 1.58 is apparently coming out tomorrow, figured I’d write this.\nETS2-QJTI release 26.01 has some issues with the 1.58 update. This is due to SCS changing some things around with the Scania R \u0026 S with this update. Older releases, however, should work fine. SCS already fixed the issue that version intended to fix, so that override will be removed with the next update anyway.\nI will also need to verify if FH6 Headlight Guard Fix needs tweaking. UPDATE FEB 12, 2026: This mod is now obsolete with 1.58.\nIt appears that all other currently supported mods for Euro Truck Simulator 2 and American Truck Simulator work without issues with the 1.58 update.\nYou can see all mods here."},"title":"ETS2/ATS Mod Status (1.58)"},"/docs/":{"data":{"":"Just about every PV Creations asset."},"title":"Asset Documentation"},"/docs/ets2_ats/":{"data":{"":"All ETS2 and ATS mods by PV Creations. They’re not very big, mind you.","american-truck-simulator#American Truck Simulator":"A full list of ATS mods can be found here.\n5700XE Sound Patch 5700XE Sound Patch\nThis mod changes the indicator and brake pressure warning sound effects for SCS’ Western Star 5700XE to be more accurate. It’s just like the pre-2017 Freightliner Cascadia. Apparently this was too laborious for SCS.\nTested with ATS version 1.46 (minimum version) and works without issues with version 1.57.\nGoogle Drive","euro-truck-simulator-2#Euro Truck Simulator 2":"ETS2 mods can be found here.","installing-ets2ats-mods#Installing ETS2/ATS mods":"Save to your respective mods folder. This is usually in C:\\Users\\\\Documents\\\\mod for Windows, ~/Library/Application Support//mod for macOS, or ~/\".local/share//mod\" for Linux. This applies to most moddable SCS games.\nAmerican Truck Simulator and Euro Truck Simulator 2 treat .zip files and .scs files equally, so unless mod instructions say otherwise, .zip mods should not be extracted.","mods#Mods":"IMPORTANT: As of 20 November 2025, American Truck Simulator and Euro Truck Simulator 2 have been updated to version 1.57. My mods should have minimal (if any) issues with the new version, but if you have any issues with them, please let me know!"},"title":"ETS2/ATS"},"/docs/ets2_ats/ats/":{"data":{"":"LT/LoneStar Realistic Blinker Speed 1.58 compatible ATS-QJTI 1.58 compatible"},"title":"American Truck Simulator"},"/docs/ets2_ats/ats/ats-qjti/":{"data":{"":"ATS-QJTI (short for American Truck Simulator Quick Job Truck Improvements), as its name suggest, aims to improve some Quick Job truck configurations for American Truck Simulator. However, it focuses more on adding new configs to the Quick Job pool than fixing pre-existing ones, which was the primary goal of its ETS2 counterpart.","all-trucks-with-a-42-chassis-option#All trucks with a 4×2 chassis option":"Added new 4×2 config As of the 1.54 update, these trucks are: Freightliner Cascadia (2019 and 2024), International LT, Kenworth T680 2014, Mack Anthem, Peterbilt 579, Volvo VNL (2014 and 2018), Western Star 57X. Truck-specific changes are described below.","changes#Changes":"","download#Download":"TruckyMods","international-lt#International LT":"Added facelift configs based on originals, plus powertrain changes (International S13 + T14, Cummins X15 + Eaton Endurant HD)","mack-anthem#Mack Anthem":"Added Black Edition config","volvo-vnl-2014#Volvo VNL 2014":"Steering wheel and interior match on configs where they didn’t originally","western-star-57x#Western Star 57X":"Additional basic configs based on originals"},"title":"ATS-QJTI"},"/docs/ets2_ats/ats/lt_lonestar_blinker/":{"data":{"":"This mod adjusts the flash rate of the SCS International LT’s and LoneStar’s turn signals to be more realistic (flash duration of 0.4 sec → 0.325 sec).","download#Download":"TruckyMods"},"title":"LT/LoneStar Realistic Blinker Speed"},"/docs/ets2_ats/ets2/":{"data":{"":"Buyable E-Tech T 1.58 compatible Additional FH4/5/6 Transmissions 1.58 compatible Additional FH4/5/6 Deflectors 1.58 compatible ETS2-QJTI 1.58 compatible S-Way Interior Sound Fix obsolete FH6 Headlight Guard Fix obsolete"},"title":"Euro Truck Simulator 2"},"/docs/ets2_ats/ets2/buyable_etech_t/":{"data":{"":"This mod allows you to buy an E-Tech T of your own – or several, if you so desire. I made this at a rapid pace before learning someone with early access to the truck had already created such a mod.\nThe config also uses the less powerful 330 kW “engine” option so you don’t need to be level 20+ to buy it. You can buy the truck at any Renault dealer or the Mod Dealer, and you might catch one in the Used Truck Dealer as well.\nTested with ETS2 version 1.50 (minimum version) and works without issues with version 1.57.","download#Download":"Google Drive"},"title":"Buyable E-Tech T"},"/docs/ets2_ats/ets2/ets2-qjti/":{"data":{"":"ETS2-QJTI (short for Euro Truck Simulator 2 Quick Job Truck Improvements), as its name suggests, aims to improve some Quick Job truck configurations for Euro Truck Simulator 2.\nSee its ATS counterpart here.","changes#Changes":"","daf-ngd#DAF NGD":"Replaced original 4×2 heavy/oversize configs with 6×4 XG+ config (2021) Added 6×4 and 8×4 configs for XFC and XG+ (2021 and 2025) These configurations are also available at any DAF dealer or the Mod Dealer.","daf-xd#DAF XD":"Replaced original 4×2 heavy/oversize configs with 6×4 XDC config (2021) Added new 2025 6×4 heavy/oversize config These configurations are also available at any DAF dealer or the Mod Dealer.","daf-xf-euro-6#DAF XF Euro 6":"Pre-existing configs now use facelift interiors if they didn’t already Added 2012 configs based on the originals The 2012 configurations will appear in the Used Dealer at random.","download#Download":"TruckyMods","iveco-s-way#Iveco S-Way":"Configs that originally used metallic paintjobs now use solid ones Higher-end configs use transmissions with retarders","man-tgx-euro-6#MAN TGX Euro 6":"Added pre-facelift configs based on the originals Added facelift oversize config based on original","volvo-fh34#Volvo FH3/4":"All FH16 configs use correct headlights (requires FH Tuning Pack)","volvo-fh56#Volvo FH5/6":"Added new 6×4 heavy/oversize configs (standard front only for the FH6) The FH5 and 6 do not feature custom beacon options. In their place, the heavy configs use the “Bonfire” beacon from the base game, and the oversize configs use the “Star” beacon from the Special Transport DLC.\nThese configurations are also available at any Volvo dealer or the Mod Dealer."},"title":"ETS2-QJTI"},"/docs/ets2_ats/ets2/fh456_deflectors/":{"data":{"":"This mod adds the rear deflectors (standard and LED) from the FH5/6 Globetrotter XL cabin to the FH4, and those from the FH4 Globetrotter XL cabin to the FH5/6.\nThe FH Tuning Pack is required if you wish to use the LED rear deflectors. However, the mod will still work without the DLC; you simply won’t see the LED deflectors in the customization menu.\nDespite the Volvo FH6 receiving Tuning Pack support with the 1.55 update, this mod does not need updating as it was already developed to accommodate that.","download#Download":"Google Drive\rTruckyMods"},"title":"Additional FH4/5/6 Deflectors"},"/docs/ets2_ats/ets2/fh456_transmissions/":{"data":{"":"This mod adds additional transmissions for the SCS Volvo FH4, FH5 and FH6: I-Shift Dual Clutch (SPO2812) and I-Shift ATO3512F (FH4/5)/ATO3812G (FH6) with ASO-(UL)C + ARSO-MSR. All are available with or without a retarder.","download#Download":"TruckyMods"},"title":"Additional FH4/5/6 Transmissions"},"/docs/ets2_ats/ets2/fh6_hl_fix/":{"data":{"":"IMPORTANT: This mod is OBSOLETE as of ETS2 version 1.58.1.1. Please disable or unsubscribe from it once you update to the new version. This was a quick fix for this issue where the only headlight guards available for the FH6 were those designed for the Aero front end. This mod added to the FH6 the headlight guards originally designed for the FH5. However, the FH5’s headlight guards have been tweaked so that they will no longer work with the Heavy Duty Bumper to the different headlight design; this also applies to the FH6.\nThe Forest Machinery DLC is required.","download#Download":"ShareMods\rGoogle Drive"},"title":"FH6 Headlight Guard Fix"},"/docs/ets2_ats/ets2/sway_sfx_fix/":{"data":{"":"IMPORTANT: This mod only works in ETS2 version 1.53. It has been deliberately version-locked for all other versions. If this bug is reintroduced in a later version, please let me know! This mod was created as an interim solution for this issue where the Iveco S-Way’s interior sounds would conflict with those of the Volvo FH5 and FH6. If you are using ETS2 version 1.54 or later, you should remove this mod from your mods folder as SCS fixed the issue with that version, making it obsolete.","discuss#Discuss":"SCS Forums","download#Download":"Google Drive"},"title":"S-Way Interior Sound Fix (Temp)"},"/docs/guides/setattribute/":{"data":{"":"This guide shows you how to set an attribute for any Roblox instance. Beginning with PVC’s MT4 series, this method has been adopted for changing alarm parameters such as tone and strobe intensity (some models only), instead of using the traditional method of havivng all parameters defined in a script. This allows developers to more easily make use of services like CollectionService, if necessary, while maintaining individuality between multiple alarms.","assumptions#Assumptions":"This guide assumes you are not enrolled in the Next Generation Studio Preview beta, but if you are, the instructions here should be mostly similar.","prerequisites#Prerequisites":"You will need:\nRoblox Studio Object Explorer panel Properties panel Already have these? Skip to the main section.","setting-an-attribute#Setting an attribute":"Select the desired instance in the viewport or the Object Explorer. The instance’s properties appear in the Properties panel. If necessary, scroll down to the Attributes section. Set the desired attributes.","steps#Steps":"","toggle-the-object-explorer-panel#Toggle the Object Explorer panel":"2014 ribbon bar: On the ribbon, in the View group, click the Explorer button. 2025 ribbon bar: On the ribbon, in the Home group, click the Explorer button. Alternatively, you can press Alt+X (Windows) or Option+X (macOS).","toggle-the-properties-panel#Toggle the Properties panel":"2014 ribbon bar: On the ribbon, in the View group, click the Properties button. 2025 ribbon bar: On the ribbon, in the Home group, click the Properties button."},"title":"Setting an attribute"},"/docs/roblox/":{"data":{"":"All PVC assets for the Roblox platform.","fire-alarms#Fire alarms":"Wheelock Exceder LED3 Wheelock Exceder Xenon System Sensor L-Series Simplex TrueAlert SmartSync Wheelock MT4","furniture#Furniture":"Lounge Chairs Flourish II Apex! Desks (Unsupported) Legacy","misc#Misc":"WIP"},"title":"Roblox"},"/docs/roblox/fire_alarms/":{"data":{"":"Wheelock Exceder LED3 Wheelock Exceder Xenon System Sensor L-Series Simplex TrueAlert SmartSync Wheelock MT4"},"title":"Fire Alarms"},"/docs/roblox/fire_alarms/exceder_led3/":{"data":{"":"The Wheelock Exceder LED3 collection is PVC’s very first – and largest. It was first released in January 2019, with a remastered version releasing in 2021, consisting of completely remodeled wall-mount devices among other updates. Not to mention lower poly count – that’s always nice!\nThese alarms were tested with moneyLAB’s RSA2000 system and should also be compatible with other systems based on that standard.\nIMPORTANT: With Release 25.04, these alarms now use CollectionService. As such, their scripts have been extensively restructured in a way that means that alarms no longer have individual scripts. All alarms are now controlled by the scripts in the “!Scripts_PVC_P01R” folder. I recommend you place this folder to ServerScriptService, but because the alarms have no module calls – for which scripts are needed – this is by no means essential.\nRoblox Creator Store Ko-fi Shop","changelog#Changelog":"","contents#Contents":"A total of 106 devices are included.","details#Details":"First release (overall): Release Candidate 1 (19 January 2019) First release (PVC): 21.11 (2 November 2021) Latest release: 25.04c (7 August 2025)","fire#Fire":"Red White LHSR3 – wall-mount combination horn/strobe LHSRC3 – ceiling-mount combination horn/strobe LSTR3 – wall-mount strobe LSTRC3 – ceiling-mount strobe LSPKR – wall-mount speaker LSPSTR3 – wall-mount combination speaker/strobe LSPSTRC3 – ceiling-mount combination speaker/strobe LFHNKR3 – wall-mount low-frequency sounder LFHSKR3 – wall-mount combination low-frequency sounder/110 cd strobe LFHSHR3 – wall-mount combination low-frequency sounder/177 cd strobe LHSW3 – wall-mount combination horn/strobe LHSWC3 – ceiling-mount combination horn/strobe LSTW3 – wall-mount strobe LSTWC3 – ceiling-mount strobe LSPKW – wall-mount speaker LSPSTW3 – wall-mount combination speaker/strobe LSPSTWC3 – ceiling-mount combination speaker/strobe LFHNKW3 – wall-mount low-frequency sounder LFHSKW3 – wall-mount combination low-frequency sounder/110 cd strobe LFHSHW3 – wall-mount combination low-frequency sounder/177 cd strobe","general-notification#General notification":"Red; plain White; plain Red; ALERT White; ALERT LHNR3 – wall-mount horn LHNRC3 – ceiling-mount horn LHSR3-N – wall-mount combination horn/strobe LHSRC3-N – ceiling-mount combination horn/strobe LHSRC3-NA – with amber lens LHSRC3-NB – with blue lens LSTR3-N – wall-mount strobe LSTR3-NA – with amber lens LSTR3-NB – with blue lens LSTRC3-N – ceiling-mount strobe LSTRC3-NA – with amber lens LSTRC3-NB – with blue lens LSPKR-N – wall-mount speaker LSPKRC – ceiling-mount speaker LSPSTR3-N – wall-mount combination speaker/strobe LSPSTR3-NA – with amber lens LSPSTR3-NB – with blue lens LSPSTRC3-N – ceiling-mount combination speaker/strobe LSPSTRC3-NA – with amber lens LSPSTRC3-NB – with blue lens LFHNKR3-N – wall-mount low-frequency sounder LFHSKR3-N – wall-mount combination low-frequency sounder/110 cd strobe LFHSHR3-N – wall-mount combination low-frequency sounder/177 cd strobe LHNW3 – wall-mount horn LHNWC3 – ceiling-mount horn LHSW3-N – wall-mount combination horn/strobe LHSWC3-N – ceiling-mount combination horn/strobe LHSWC3-NA – with amber lens LHSWC3-NB – with blue lens LSTW3-N – wall-mount strobe LSTW3-NA – with amber lens LSTW3-NB – with blue lens LSTWC3-N – ceiling-mount strobe LSTWC3-NA – with amber lens LSTWC3-NB – with blue lens LSPKW-N – wall-mount speaker LSPKWC – ceiling-mount speaker LSPSTW3-N – wall-mount combination speaker/strobe LSPSTW3-NA – with amber lens LSPSTW3-NB – with blue lens LSPSTWC3-N – ceiling-mount combination speaker/strobe LSPSTWC3-NA – with amber lens LSPSTWC3-NB – with blue lens LFHNKW3-N – wall-mount low-frequency sounder LFHSKW3-N – wall-mount combination low-frequency sounder/110 cd strobe LFHSHW3-N – wall-mount combination low-frequency sounder/177 cd strobe LHSR3-AL – wall-mount combination horn/strobe LHSRC3-AL – ceiling-mount combination horn/strobe LHSRC3-ALA – with amber lens LHSRC3-ALB – with blue lens LSTR3-AL – wall-mount strobe LSTR3-ALA – with amber lens LSTR3-ALB – with blue lens LSTRC3-AL – ceiling-mount strobe LSTRC3-ALA – with amber lens LSTRC3-ALB – with blue lens LSPKR-AL – wall-mount speaker LSPSTR3-AL – wall-mount combination speaker/strobe LSPSTR3-ALA – with amber lens LSPSTR3-ALB – with blue lens LSPSTRC3-AL – ceiling-mount combination speaker/strobe LSPSTRC3-ALA – with amber lens LSPSTRC3-ALB – with blue lens LFHNKR3-AL – wall-mount low-frequency sounder LFHSKR3-AL – wall-mount combination low-frequency sounder/110 cd strobe LFHSHR3-AL – wall-mount combination low-frequency sounder/177 cd strobe LHSW3-AL – wall-mount combination horn/strobe LHSWC3-AL – ceiling-mount combination horn/strobe LHSWC3-ALA – with amber lens LHSWC3-ALB – with blue lens LSTW3-AL – wall-mount strobe LSTW3-ALA – with amber lens LSTW3-ALB – with blue lens LSTWC3-AL – ceiling-mount strobe LSTWC3-ALA – with amber lens LSTWC3-ALB – with blue lens LSPKW-AL – wall-mount speaker LSPSTW3-AL – wall-mount combination speaker/strobe LSPSTW3-ALA – with amber lens LSPSTW3-ALB – with blue lens LSPSTWC3-AL – ceiling-mount combination speaker/strobe LSPSTWC3-ALA – with amber lens LSPSTWC3-ALB – with blue lens LFHNKW3-AL – wall-mount low-frequency sounder LFHSKW3-AL – wall-mount combination low-frequency sounder/110 cd strobe LFHSHW3-AL – wall-mount combination low-frequency sounder/177 cd strobe","known-issues#Known issues":"None","release-candidate-1-19-january-2019#Release Candidate 1 (19 January 2019)":"Click me to reveal Initial release","release-candidate-2-1-february-2019#Release Candidate 2 (1 February 2019)":"Click me to reveal 8 new alarms with blue lenses AND their respective luminous intensity settings. ALL alarms use the material SmoothPlastic","release-candidate-3-18-may-2019#Release Candidate 3 (18 May 2019)":"Click me to reveal 46 new alarms! Some alarms didn’t have Horn sounds. That’s been fixed.","release-candidate-35-30-july-2019#Release Candidate 3.5 (30 July 2019)":"Click me to reveal Fixed LHSHW3 models’ intensity labels - changed color from white to red New free-running API. It waits for a little bit of time before flashing, if at all. All NAs are still synchronized by default, however. Improved sounds","version-2111-2-november-2021#Version 21.11 (2 November 2021)":"Click me to reveal First release under PVC group Changes from the legacy edition: Slightly larger scale Traditional horns and horn strobes now have a Temporal 3 tone option that is intended for larger/heavier games that don’t wish to use a voice-evacuation system. Of course, the panel-coded option is still there. Note that for the LHN/LHS models, the Temporal 3 option might not be able to keep up with other devices with a Temporal 3 audio. Switched strobes to use the BillboardGui style that has been pretty much traditional since 2013 LSPK/LSPST/LFHNK/LFHSH/LFHSK models are now taller than LHN/LHS/LST models, akin to their real-life counterparts Makes use of new task.wait() system instead of wait() which should improve performance when used en masse New models for all 60 wall-mount appliances which are more optimized and accurate (the ceiling-mount devices are not available for the time being; they will be facelifted — but not remodeled — in due course)","version-2203-4-march-2022#Version 22.03 (4 March 2022)":"Click me to reveal Refreshed ceiling-mount devices: new strobe parts, less detailed horn More lax license","version-2504-11-april-2025#Version 25.04 (11 April 2025)":"Click me to reveal Significant functionality improvements, including: Updated all alarms to use CollectionService and Attributes New attribute entitled “ContVisualCircuit” (boolean). Set to TRUE for strobe to flash continuously or FALSE for the strobe to flash if VisualCircuit is set to 1. Improved sound effects for low-frequency sounders All horn sounds use “InverseTapered” roll-off mode","version-2504a-3-may-2025#Version 25.04a (3 May 2025)":"Click me to reveal Restored async functionality for alarms that didn’t have them","version-2504b-26-may-2025#Version 25.04b (26 May 2025)":"Click me to reveal Implemented some logic improvements introduced with the L-Series","version-2504c-7-august-2025#Version 25.04c (7 August 2025)":"Click me to reveal Scripts will now ignore unused alarms. “Unused” is determined by an alarm being part of an RFS-based NAC peripheral. Deprecated Detagger script"},"title":"Exceder LED3"},"/docs/roblox/fire_alarms/exceder_xe/":{"data":{"":"The Wheelock Exceder Xenon collection was first released in mid-2019, with a remastered version releasing in 2022, consisting of heavily facelifted wall-mount devices. If only you could see how awful and bloated they were prior…\nThese alarms were tested with moneyLAB’s RSA2000 system and should also be compatible with other systems based on that standard.\nIMPORTANT: With Release 25.05, these alarms now use CollectionService. As such, their scripts have been extensively restructured in a way that means that alarms no longer have individual scripts. All alarms are now controlled by the scripts in the “!Scripts_PVC_P02” folder. I recommend you place this folder to ServerScriptService, but because the alarms have no module calls – for which scripts are needed – this is by no means essential.\nIf you’re using version 25.05, you should also remove tags from alarms that aren’t part of a system to prevent an issue that, more often than not, prevents alarms that are actually part of a system from working correctly. The “Detagger” script handles this automatically. This was fixed with version 25.05a, and the “Detagger” script was deprecated.\nRoblox Creator Store Ko-fi Shop","changelog#Changelog":"","contents#Contents":"A total of 43 devices are included in this collection. This is one of two PVC fire alarm collections to feature an odd number of devices, the other being the MT4 (5).","details#Details":"First release (overall): Release Candidate 1α (31 July 2019) First release (PVC): 21.06 (19 June 2021) Latest release: 25.05b (9 December 2025)","fire#Fire":"","general-notification#General notification":"","known-issues#Known issues":"None","plain#Plain":"","red#Red":"HSR – wall-mount combination horn/strobe with FIRE lettering STR – wall-mount strobe with FIRE lettering HSRC – ceiling-mount combination horn/strobe with FIRE lettering STRC – ceiling-mount strobe with FIRE lettering","red-1#Red":"HNR – wall-mount horn HSR-N – wall-mount combination horn/strobe STR-N – wall-mount strobe STR-NA – with amber lens STR-NB – with blue lens STR-NG – with green lens STR-NR – with red lens HNRC – ceiling mount horn HSRC-N – ceiling-mount combination horn/strobe STRC-N – ceiling-mount strobe STRC-NA – with amber lens STRC-NB – with blue lens STRC-NG – with green lens STRC-NR – with red lens","red-2#Red":"STR-AL – wall-mount strobe with ALERT lettering STR-ALA – with amber lens STRC-AL – ceiling-mount stobe with ALERT lettering","release-candidate-1α-31-july-2019#Release Candidate 1α (31 July 2019)":"Click me to reveal First version ever released to the public. 12 alarms are included in RC1α. More will be included in RC1β.","release-candidate-2-27-november-2019#Release Candidate 2 (27 November 2019)":"Click me to reveal Decided to skip RC1β and go straight to RC2 as this release contains 31 additional appliances.","version-2106-19-june-2021#Version 21.06 (19 June 2021)":"Click me to reveal Migrated collection to a group. The model under PenguinRescue1sAlt will no longer receive support or updates and will eventually be taken off sale. Discontinued release candidate system. What was the point? 60 cd intensity option is now available for ALL ceiling-mount devices. Prior to this release, the option was only available for colored-lens devices. Gorgeous new thumbnail designed by yours truly","version-2112-24-december-2021#Version 21.12 (24 December 2021)":"Click me to reveal All instances of wait() replaced with task.wait() Tagged all appliances with release code; please preserve this!","version-2208-19-august-2022#Version 22.08 (19 August 2022)":"Click me to reveal Facelifted wall-mount models (lenses are completely new). The updated models feature more accurate and natural curvature and also cut down on unnecessary polygons. Red labels are brighter in color Thinner rubber seams for all backboxes Lighting effects optimized for Future is Bright: Phase 3 60 cd intensity option added for STWC-N. Sorry for missing it with the June 2021 update - thank you themasoners for catching this bug!","version-2301-11-january-2023#Version 23.01 (11 January 2023)":"Click me to reveal Cleaned up wall-mount lens geometry. This also fixes bulging in certain areas.","version-2501-17-january-2025#Version 25.01 (17 January 2025)":"Click me to reveal Fixed an issue where strobes would only flash once on continuous visual circuits Upgraded all models to use Attributes (excl. HN/HNC) Not super important but… the models are a bit closer together now Removed skybox from Ko-fi release","version-2505-26-may-2025#Version 25.05 (26 May 2025)":"Click me to reveal Upgraded all models to use CollectionService","version-2505a-7-august-2025#Version 25.05a (7 August 2025)":"Click me to reveal Scripts will now ignore unused alarms. “Unused” is determined by an alarm being part of an RFS-based NAC peripheral. Deprecated Detagger script","version-2505b-9-december-2025#Version 25.05b (9 December 2025)":"Click me to reveal Fixed ceiling mount alarms not working","white#White":"HSW – wall-mount combination horn/strobe with FIRE lettering STW – wall-mount strobe with FIRE lettering HSWC – ceiling-mount combination horn/strobe with FIRE lettering STWC – ceiling-mount strobe with FIRE lettering","white-1#White":"HNW – wall-mount horn HSW-N – wall-mount combination horn/strobe STW-N – wall-mount strobe STW-NA – with amber lens STW-NB – with blue lens STW-NG – with green lens STW-NR – with red lens HNWC – ceiling mount horn HSWC-N – ceiling-mount combination horn/strobe STWC-N – ceiling-mount strobe STWC-NA – with amber lens STWC-NB – with blue lens STWC-NG – with green lens STWC-NR – with red lens","white-2#White":"STW-AL – wall-mount strobe with ALERT lettering STW-ALA – with amber lens STWC-AL – ceiling-mount stobe with ALERT lettering STWC-ALA – with amber lens"},"title":"Exceder Xenon"},"/docs/roblox/fire_alarms/lseries/":{"data":{"":"The System Sensor L-Series collection is PVC’s most popular. It was first released in October 2019. The collection contains 58 devices.\nThese alarms were tested with moneyLAB’s RSA2000 system and should also be compatible with other systems based on that standard.\nIMPORTANT: With Release 25.04, these alarms now use CollectionService. As such, their scripts have been extensively restructured in a way that means that alarms no longer have individual scripts. All alarms are now controlled by the scripts in the “!Scripts_PVC_P03” folder. I recommend you place this folder to ServerScriptService, but because the alarms have no module calls – for which scripts are needed – this is by no means essential.\nYou should also remove tags from alarms that aren’t part of a system to prevent an issue that, more often than not, prevents alarms that are actually part of a system from working correctly. The “Detagger” script handles this automatically. This was fixed with version 25.04a.\nRoblox Creator Store\rKo-fi Shop","alpha-1-25-october-2019#Alpha 1 (25 October 2019)":"Click me to reveal First version ever released to the public. 4 alarms are included in α 1. More will be included in α 2.","alpha-11-26-october-2019#Alpha 1.1 (26 October 2019)":"Click me to reveal Fixed horn sound not fading out","alpha-2-25-november-2019#Alpha 2 (25 November 2019)":"Click me to reveal NEW alarms: P2G family (P2GRL \u0026 P2GWL) and their corresponding surface-mount backboxes - SBBGRL and SBBGWL! H and HG family","alpha-21-28-november-2019#Alpha 2.1 (28 November 2019)":"Click me to reveal The last Alpha update and the last update for the L-Series of the year 2019. More variants will be added between January and April 2020. NEW alarms: Ceiling mount horn/strobes and strobes. System Sensor does not produce L-Series (or SpectrAlert Advance) ceiling-mount horns.","beta-01-1-march-2020#Beta 0.1 (1 March 2020)":"Click me to reveal NEW alarms: SPS \u0026 SP 3100Hz tone for L-Series horns \u0026 horn/strobes. It’s not the default setting, and I don’t recommend using it. Labels for PC and SC are now derived from craigery96’s SpectrAlert alarms. Outer ring for ceiling-mounts has been improved BillboardGuis for strobes are slightly offset forward","beta-01-17-march-2020#Beta 0.1 (17 March 2020)":"Click me to reveal Fixed issue with PC2RL having an extra part","beta-015-6-april-2020#Beta 0.15 (6 April 2020)":"Click me to reveal NEW alarms: SPSCRL \u0026 SPSCWL","beta-02-25-december-2020#Beta 0.2 (25 December 2020)":"Click me to reveal NEW alarms: HRL-LF, HGRL-LF, and their white counterparts P2RL-LF and its white counterpart The above appliances can be independently set to Temporal 3, but they work best if your panel is set to continuous. Using these should also help improve game performance. Fixed incorrect intensity settings for wall-mounts","changelog#Changelog":"","contents#Contents":"A total of 58 wall- and ceiling-mounted, indoor-rated alarm appliances are included, for both fire and general notification use.","details#Details":"First release (overall): Alpha 1 (25 October 2019) First release (PVC): 21.07 (1 July 2021) Latest release: 25.04a (7 August 2025)","fire#Fire":"Red White P2RL – full-width wall-mount combination horn/strobe with FIRE lettering P2GRL – single-gang wall-mount combination horn/strobe with FIRE lettering PC2RL – ceiling-mount combination horn/strobe with FIRE lettering P2RL-LF – full-width wall-mount combination 520 Hz sounder/strobe with FIRE lettering SRL – full-width wall-mount strobe with FIRE lettering SGRL – single-gang wall-mount strobe with FIRE lettering SCRL – ceiling-mount strobe with FIRE lettering SPSRL – wall-mount combination speaker/strobe with FIRE lettering SPSCRL – ceiling-mount combination speaker/strobe with FIRE lettering P2WL – full-width wall-mount combination horn/strobe with FIRE lettering P2GWL – single-gang wall-mount combination horn/strobe with FIRE lettering PC2WL – ceiling-mount combination horn/strobe with FIRE lettering P2WL-LF – full-width wall-mount combination 520 Hz sounder/strobe with FIRE lettering SWL – full-width wall-mount strobe with FIRE lettering SGWL – single-gang wall-mount strobe with FIRE lettering SCWL – ceiling-mount strobe with FIRE lettering SPSWL – wall-mount combination speaker/strobe with FIRE lettering SPSCWL – ceiling-mount combination speaker/strobe with FIRE lettering","fuego-spanish#Fuego (Spanish)":"Red White P2RL-SP – full-width wall-mount combination horn/strobe with FUEGO lettering P2GRL-SP – single-gang wall-mount combination horn/strobe with FUEGO lettering SRL-SP – full-width wall-mount strobe with FUEGO lettering SGRL-SP – single-gang wall-mount strobe with FUEGO lettering SPSRL-SP – wall-mount combination speaker/strobe with FUEGO lettering P2WL-SP – full-width wall-mount combination horn/strobe with FUEGO lettering P2GWL-SP – single-gang wall-mount combination horn/strobe with FUEGO lettering SWL-SP – full-width wall-mount strobe with FUEGO lettering SGWL-SP – single-gang wall-mount strobe with FUEGO lettering SPSWL-SP – wall-mount combination speaker/strobe with FUEGO lettering","general-notification#General notification":"SWL-ALERT – full-width wall-mount strobe with amber lens and ALERT lettering SWL-CLR-ALERT – full-width wall-mount strobe with clear lens and ALERT lettering SCWL-CLR-ALERT – ceiling-mount strobe with clear lens and ALERT lettering SPSWL-ALERT – wall-mount combination speaker/strobe with amber lens and ALERT lettering SPSWL-CLR-ALERT – wall-mount combination speaker/strobe with clear lens and ALERT lettering SPSWL-CLR-ALERT – ceiling-mount combination speaker/strobe with clear lens and ALERT lettering","known-issues#Known issues":"None","unmarked#Unmarked":"The label parts weren’t removed from these models, allowing you to easily add labels to them if you wish.\nRed White CHRL – full-width wall-mount chime CHSRL – full-width wall-mount combination chime/strobe CHSCRL – ceiling-mount combination chime/strobe HRL – full-width wall-mount horn HGRL – single-gang wall-mount horn P2RL-P – full-width wall-mount combination horn/strobe PC2RL-P – ceiling-mount combination horn/strobe SRL-P – full-width wall-mount strobe SCRL-P – ceiling-mount strobe SPRL – wall-mount speaker SPSRL-P – wall-mount combination speaker/strobe SPSCRL-P – ceiling mount combination speaker/strobe CHWL – full-width wall-mount chime CHSWL – full-width wall-mount combination chime/strobe CHSCWL – ceiling-mount combination chime/strobe HWL – full-width wall-mount horn HGWL – single-gang wall-mount horn P2WL-P – full-width wall-mount combination horn/strobe PC2WL-P – ceiling-mount combination horn/strobe SWL-P – full-width wall-mount strobe SCWL-P – ceiling-mount strobe SPWL – wall-mount speaker SPSWL-P – wall-mount combination speaker/strobe SPSCWL-P – ceiling mount combination speaker/strobe","version-2107-1-july-2021#Version 21.07 (1 July 2021)":"Click me to reveal Migrated to group ownership Strobe lights now emit from the front of the strobe part! They used to emit from the top for whatever reason… Fixed backbox name for PC2WL and SCWL — changed name to SBBCWL from SBBCRL NEW alarms: P2RL-P, SPSRL-P, PC2RL-P, SPSCRL-P, CHSRL, CHRL, CHSCRL, and their white counterparts. Six more that are reskins of pre-existing stuff: SCWL-CLR-ALERT, SPSCWL-CLR-ALERT, SPSWL-(CLR-)ALERT, SWL-(CLR-)-ALERT","version-2112-24-december-2021#Version 21.12 (24 December 2021)":"Click me to reveal All instances of wait() replaced with task.wait() Tagged all appliances with release code; please preserve this!","version-2401-24-january-2024#Version 24.01 (24 January 2024)":"Click me to reveal Updated strobes for wall-mounts. GOD those were awful Corrected some model names (backboxes for low-frequency models)","version-2407-18-july-2024#Version 24.07 (18 July 2024)":"Click me to reveal Fixed some model names","version-2407-5-july-2024#Version 24.07 (5 July 2024)":"Click me to reveal Adjusted label dimensions Fixed an issue where strobes would only flash once with continuous visual circuits Red labels brighter NEW alarms with Spanish FUEGO labels: P2RL-SP, P2GRL-SP, SRL-SP, SGRL-SP, SPSRL-SP and their white counterparts","version-2504-30-april-2025#Version 25.04 (30 April 2025)":"Click me to reveal Upgraded all models to use CollectionService, Attributes, and tone/strobe intensity modules New tone samples, plus new Temporal 4 tone, for low-frequency models","version-2504a-7-august-2025#Version 25.04a (7 August 2025)":"Click me to reveal Scripts will now ignore unused alarms. “Unused” is determined by an alarm being part of an RFS-based NAC peripheral. Deprecated Detagger script"},"title":"L-Series"},"/docs/roblox/fire_alarms/mt4/":{"data":{"":"The Wheelock MT4 collection is PVC’s most recent, having first been released on 24 April 2024. The collection contains 5 devices. If you want to be more technical, it contains 7, as one device combines three models.\nThese alarms were tested with moneyLAB’s RSA2000 system and should also be compatible with other systems based on that standard.\nIMPORTANT: With Release 25.08, these alarms now use CollectionService. As such, their scripts have been extensively restructured in a way that means that alarms no longer have individual scripts. All alarms are now controlled by the scripts in the “!Scripts_PVC_P11” folder. I recommend you place this folder to ServerScriptService, but because the alarms have no module calls – for which scripts are needed – this is by no means essential.\nRoblox Creator Store\rKo-fi Shop","changelog#Changelog":"","contents#Contents":"A total of five wall-mount devices are included.\nMT4-115-R – red horn MT4-115-S – silver horn MT4-115-WH-VFR – red horn + white 15cd strobe with FIRE lettering MT4-115-WH-VNS – silver horn + white 15cd unlettered strobe MT4-24-LS/MS/IS-VFR – red horn + UL 1971-compliant 15/30/75cd strobe with FIRE lettering","details#Details":"First release: 24.04 (24 April 2024) Latest release: 25.08 (6 August 2025)","known-issues#Known issues":"None","strobe-intensities#Strobe intensities":"Strobe type Intensity WH, LS 15 cd MS 30 cd IS 75 cd","version-2404-24-april-2024#Version 24.04 (24 April 2024)":"Click me to reveal First version to be released.","version-2405-27-may-2024#Version 24.05 (27 May 2024)":"Click me to reveal Added flashtube click SFX. Added MT4-24-LS/MS/IS-VFR.","version-2408-4-august-2024#Version 24.08 (4 August 2024)":"Click me to reveal Updated horn model","version-2508-6-august-2025#Version 25.08 (6 August 2025)":"Click me to reveal Tone logic closer to that of other alarms. No more BindableEvents! Updated all alarms to use CollectionService"},"title":"MT4"},"/docs/roblox/fire_alarms/truealert/":{"data":{"":"The Simplex TrueAlert SmartSync collection is PVC’s first new collection in almost four years!\nThese alarms were tested with moneyLAB’s RSA2000 system and should also be compatible with other systems based on that standard.\nIMPORTANT: With Release 25.02, these alarms now use CollectionService. As such, their scripts have been extensively restructured in a way that means that alarms no longer have individual scripts. All alarms are now controlled by the scripts in the “!Scripts_PVC_P10” folder. I recommend you place this folder to ServerScriptService, but because the alarms have no module calls – for which individual scripts are needed – this is by no means essential.\nRoblox Creator Store Ko-fi Shop","changelog#Changelog":"","contents#Contents":"The pack contains 24 wall-mount devices.\nRed White 4901-9820 with 4905-9988 cover – horn 4902-9210 – chime 4902-9716 – speaker 4906-9101 – strobe, regular intensity 4906-9105 – outdoor strobe, UL intensities 4906-9109 – strobe, high intensity 4906-9113 - outdoor strobe, ULC intensities 4906-9127 – combination horn/strobe, regular intensity 4906-9131 – outdoor combination horn/strobe, UL intensities 4906-9133 – chime/strobe, regular intensity 4906-9139 – combination horn/strobe, high intensity 4906-9143 – outdoor combination horn/strobe, ULC intensities 4906-9151 – combination speaker/strobe, regular intensity 4901-9820 with 4905-9989 cover – horn 4902-9211 – chime 4902-9717 – speaker 4906-9103 – strobe, regular intensity 4906-9106 – outdoor strobe, UL intensities 4906-9111 – strobe, high intensity 4906-9129 – combination horn/strobe, regular intensity 4906-9132 – outdoor combination horn/strobe, UL intensities 4906-9134 – combination chime/strobe, regular intensity 4906-9141 – combination horn/strobe, high intensity 4906-9153 – combination speaker/strobe, regular intensity","details#Details":"First release: 23.07 (4 July 2023) Latest release: 25.02b (7 August 2025)","known-issues#Known issues":"None","strobe-intensities#Strobe intensities":"Strobe type Options Models Regular intensity 15/30/75/110 cd 9101, 9103, 9127, 9129, 9133, 9134, 9151, 9153 High intensity 135/177/185 cd 9109, 9111, 9139, 9141 Outdoor intensities (UL) 15/60/75 cd 9105, 9106, 9131, 9132 Outdoor intensities (ULC) 5/20/30 cd 9113, 9143","version-2307-4-july-2023#Version 23.07 (4 July 2023)":"Click me to reveal First version released to the public. Happy fourth of July!","version-2412-7-december-2024#Version 24.12 (7 December 2024)":"Click me to reveal 2 new models: 4902-9210/-9211 chimes More detailed horn and speaker models. They should look better without ambient occlusion enabled… and maybe with, too. Upgraded all models to use Attributes (excl. 9820s) Label improvements! All models now feature make/model labels, and all labels now follow the curve of the alarms. Fixed an issue where strobes would only flash once with continuous visual circuits","version-2502-1-february-2025#Version 25.02 (1 February 2025)":"Click me to reveal Updated all models to use CollectionService. This will make things easier for you AND me! New attribute entitled “ContVisualCircuit” (boolean). Set to TRUE for strobe to flash continuously or FALSE for the strobe to flash if VisualCircuit is set to 1. 6 new models: 4906-9105/-9106/-9113 weatherproof strobes 4906-9131/-9132/-9143 weatherproof horn strobes","version-2502a-10-april-2025#Version 25.02a (10 April 2025)":"Click me to reveal Fixed issue where some alarms simply wouldn’t work; this was traced back to improperly defined functions","version-2502b-7-august-2025#Version 25.02b (7 August 2025)":"Click me to reveal Scripts will now ignore unused alarms. “Unused” is determined by an alarm being part of an RFS-based NAC peripheral. Added strobe intensity ModuleScript"},"title":"TrueAlert"},"/docs/roblox/furniture/":{"data":{"":"Lounge Chairs Flourish II Apex! Desks Mesa Tables (Unsupported) Legacy"},"title":"Furniture"},"/docs/roblox/furniture/apex_desks/":{"data":{"":"Apex – a desk set designed to complement the Flourish II chairs.\nI started working on Apex in early 2023 and released in the middle of that year.\nLargely inspired by the Silhouette series by Smith System, Apex features three book box options, two height options, two width options, and two surface options. All versions are also height-adjustable, although they can only be adjusted in Studio for the time being. Since Release 23.09, all versions of Apex support the use of SurfaceAppearance.\nRoblox Creator Store Ko-fi Shop","contents#Contents":"A total of 24 desks are available.","details#Details":"First release: 23.06 (18 June 2023) Latest release: 23.09 (10 September 2023)","known-issues#Known issues":"None"},"title":"Apex! Desks"},"/docs/roblox/furniture/flourish_2/":{"data":{"":"Flourish II – also known as Flourish 2, Flourish Series 2, or Flourish Deux – the successor to the legendary Flourish collection first introduced in early 2015 (15 March 2015 to be exact). Its release date was not coincidental.\nI had worked on Flourish II sporadically between August 2022 and May 2023 (lack of time :P), and while I think the original Flourish series aged quite well for an 8-year-old design – better than a lot of my older (and even some newer) furniture designs – but after a while, I felt it was time for its successor.\nThe original Flourish was heavily inspired by Artcobell’s Alphabet and HON’s SmartLink lines, but Flourish II additionally takes inspiration from Virco’s Civitas frame, which is used on the manufacturer’s Analogy, Sage and ZUMA lines.\nRoblox Creator Store Ko-fi Shop","changelog#Changelog":"","contents#Contents":"A total of 16 chairs are available.","details#Details":"First release: 23.05 (13 May 2023) Latest release: 24.09b (2 October 2024)","gallery#Gallery":"Cantilever Four-Leg Sled Stool 1 Stool 2","known-issues#Known issues":"None","version-2305-13-may-2023#Version 23.05 (13 May 2023)":"Click me to reveal First version to be released to the public. Includes five frame options, with or without cushions (total 10): 4-leg chair with glides Cantilever chair Sled-base chair 4-leg stool (Flourish I/Virco Civitas-style) with glides 4-leg stool (HON SmartLink style) with glides","version-2409-15-september-2024#Version 24.09 (15 September 2024)":"Click me to reveal Added three new models, with or without cushions (total 6): 4-leg chair with casters 4-leg stool (Flourish I/Virco Civitas-style) with casters 4-leg stool (HON SmartLink-style) with casters Fixed some instance names for consistency","version-2409a-25-september-2024#Version 24.09a (25 September 2024)":"Click me to reveal Slightly adjusted caster model to be smoother","version-2409b-2-october-2024#Version 24.09b (2 October 2024)":"Click me to reveal Slightly adjusted legs for caster variants for consistency"},"title":"Flourish II"},"/docs/roblox/furniture/legacy_seet/":{"data":{"":"The following items are considered unsupported and thus will not receive any updates. If you receive a pop-up regarding the chairs having scripts, this is generally because they use a script to compensate for an ages-old issue with anchored Seats (the Roblox instance); these chairs also lack support for R15. The anchored seat issue has been resolved for several years. You are free to use them in your projects, although better options exist. All legacy SEET products.","brillia#Brillia":"Released in 2015, facelifted in December 2017 (or was it January 2018?) with Brillia Series 1.5. An upholstered variant was also introduced then.\nNo R15 support for Series 1","consolidate#Consolidate":"Released in 2015.","enrich#Enrich":"Huh? Released in 2015.\nNo R15 support","excel#Excel":"Chairs inspired by Allsteel’s Take-5 line. Released in 2015.\nNo R15 support","explore#Explore":"Inspired by Artcobell’s Discover series. Not very good. Released in 2015.\nNo R15 support","flourish-i#Flourish I":"The venerable Flourish legacy series has cemented itself as SEET’s quintessential product line (i.e. the one that’s held up better than the rest). First released in 2015 with further variants being released up to 2018.","hoist#Hoist":"Released in 2014(?)\nNo R15 support","impact#Impact":"The de-facto replacement for Intent. Released December 2017.","intent#Intent":"Seemingly abstract block arrangements that don’t seem to have done too well. Released January 2017.","nova#Nova":"Chairs inspired by Allsteel’s Seek line. I tried to be very quirky, which ultimately led to the failure of the first generation released in 2015. A second generation, dubbed Nova2, was released in 2017.\nNo R15 support for Nova 1"},"title":"Legacy SEET"},"/docs/roblox/furniture/lounge_chairs/":{"data":{"":"A collection of lounge chairs I made in about five hours. They are heavily based on HON’s Grove series and designed with an emphasis on color customization and modularity. There are four versions: single seat, double seat, double seat with middle table, and triple seat. All versions come in three arm styles: no arms, square arms, and tapered arms.\nRoblox Creator Store Ko-fi Shop","changelog#Changelog":"","contents#Contents":"A total of 12 chairs are available.","details#Details":"First release: 22.10 (9 October 2022) Latest release: 22.10 (9 October 2022)","known-issues#Known issues":"None","version-2210#Version 22.10":"released 9 October 2022\nFirst version to be released to the public. Includes four seat styles with three arm options (total 12) Seat options One-person seat Two-person seat Three-person seat Two-person seat with intermediate table Arm options No arms Square arms Tapered arms"},"title":"Lounge chairs"},"/docs/roblox/furniture/mesa_tables/":{"data":{"":"I created the Mesa table collection because people were resorting to using Apex in place of proper tables. If you were one of those people, I sincerely apologize and dedicate Mesa to you. Enjoy!\nTable surfaces are optimized for use with the SurfaceAppearance instance.\nEverything in this collection is a reference to a phenomenal television franchise. Vravo, Bince!\nRoblox Creator Store\rKo-fi Shop","changelog#Changelog":"","contents#Contents":"A total of 4 tables are available.","details#Details":"First release: 25.04 (4 April 2025) Latest release: 25.04 (4 April 2025)","known-issues#Known issues":"None","version-2504-4-april-2025#Version 25.04 (4 April 2025)":"Click me to reveal First version to be released to the public. Two height and two width options (total 4 tables): 4x8 and 4x12 width options Standard and extended height options (meant to match Apex)"},"title":"Mesa Tables"},"/links/":{"data":{"":"","links#Links":""},"title":"Links"},"/privacy/":{"data":{"":"Most terms of service and privacy policies are extremely long passages of Legalese, which is pretty much incomprehensible to anyone who’s not a lawyer – or ChatGPT. This privacy policy is not that.","information-collected-by-pv-creations#Information collected by PV Creations":"PV Creations only collects website-related data through emails sent to its email address: pv.creations.rbx@gmail.com. Collected data will be used to improve the site.","information-collected-by-this-site#Information collected by this site":"This website, in and of itself, does not collect any data."},"title":"Privacy Policy"}}