{"/blog/a/":{"data":{"":"","test-blog#Test blog":"This is a test blog post"},"title":"A"},"/blog/rebrand/":{"data":{"":"A rebrand was long overdue.\nBut first, here’s the backstory of the original PV Creations logo.","the-new-logo#The new logo":"Most importantly PV Creations’ new logo isn’t too different from the original, but I made a few changes:\nTypeface: Agency FB replaces Poppins as the PVC logo’s font. A condensed font (at least on Windows), Agency FB takes up more vertical space within the circle, making the logo more visually appealing and – in my opinion, at least – proportional. …and that’s about it. It’s already live as the Discord server’s icon and will be rolled out to other PVC outlets in due course. Let me know what you think in the Discord server!","the-original-logo#The original logo":"I created PV Creations’ original logo in 2021 on an app called Vectornator (now known as Linearity Curve). The logo comprises the letters “PVC” enclosed in a circle. The logo received a few tweaks over the years, but its fundamanetals remained unchanged. I originally intended that the logo was change color over time, but this was quickly abandoned and the original purple gradient stuck. This was later changed to a solid purple envisaged as an “in-between” of the two.\nThe original logo was never available in SVG format, not because of some technical limitation, but because 1. I didn’t know how to edit SVG files using a text editor (doesn’t help that TextEdit sucks) and 2. I never thought I’d need one.\nAt the end of 2023 I got a “new” Windows PC. Unfortunately Linearity Curve is only available for the iPad and Mac. I don’t have an iPad, and my Mac had become unbearably slow. I never took the opportunity to vectorize it, although I probably should’ve."},"title":"Rebrand"},"/docs/":{"data":{"":"","if-nothings-showing-up-on-the-left#If nothing\u0026rsquo;s showing up on the left\u0026hellip;":"Just about every PV Creations asset.\nIf nothing’s showing up on the left… Don’t panic. It probably wasn’t published yet. This is a work in progress, after all. Or maybe I don’t know how this Hugo thing works."},"title":"Asset Documentation"},"/docs/ets2_ats/":{"data":{"":"","installing-ets2ats-mods#Installing ETS2/ATS mods":"","mods#Mods":"All ETS2 and ATS mods by PV Creations. They’re not very big, mind you.\nInstalling ETS2/ATS mods Save to your respective mods folder. This is usually in C:\\Users\\\u003cyour name\u003e\\Documents\\\u003cgame\u003e\\mod for Windows, ~/Library/Application Support/\u003cgame\u003e/mod for macOS, or ~/\".local/share/\u003cgame\u003e/mod\" for Linux. This applies to most moddable SCS games.\nAmerican Truck Simulator and Euro Truck Simulator 2 treat .zip files and .scs files equally, so unless mod instructions say otherwise, .zip mods should not be extracted.\nMods ⚠️ IMPORTANT: As of 28 November 2024, Euro Truck Simulator 2 and American Truck Simulator has been updated to version 1.53. My mods should have minimal (if any) issues with the new version due to their scope – and because they, unlike a certain paid truck mod, don’t mess with important files – but if you have any issues with them, please let me know! American Truck Simulator 5700XE Sound Patch 5700XE Sound Patch\nThis mod changes the indicator and brake pressure warning sound effects for SCS’ Western Star 5700XE to be more accurate. It’s just like the pre-2017 Freightliner Cascadia. Apparently this was too laborious for SCS.\nTested with ATS version 1.46 (minimum version) and works without issues with version 1.53.\nGoogle Drive\rEuro Truck Simulator 2 Buyable E-Tech T Additional FH5 \u0026 FH6 Transmissions Modern FH Deflector for FH4 Globetrotter XL ETS2-QJTI Buyable E-Tech T\nThis mod allows you to buy an E-Tech T of your own – or several, if you so desire. I made this at a rapid pace before learning someone with early access to the truck had already created such a mod.\nThe config also uses the less powerful 330 kW “engine” option so you don’t need to be level 20+ to buy it. You can buy the truck at any Renault dealer or the Mod Dealer, and you might catch one in the Used Truck Dealer as well.\nTested with ETS2 version 1.50 (minimum version) and works without issues with version 1.53.\nGoogle Drive\rAdditional FH5 \u0026 FH6 Transmissions\n(now called Additional FH4, FH5, and FH6 Transmissions from 22 January 2025)\nThis mod adds additional transmissions for the Volvo FH4, FH5 and FH6: I-Shift Dual Clutch (SPO2812A) and I-Shift ATO3512F (FH4/5)/ATO3812G (FH6) with ASO-(UL)C + ARSO-MSR. All are available with or without a retarder.\nTested with ETS2 version 1.53.\nGoogle Drive\rTruckyMods\rModern FH Deflector for FH4 Globetrotter XL\nThis mod adds the rear deflectors (standard and LED) from the FH5/6 Globetrotter XL cabin to the FH4.\nThe FH Tuning Pack is required, but only if you wish to use the LED rear deflector.\nTested with ETS2 version 1.53 (minimum version).\nGoogle Drive\rTruckyMods\rSee this page"},"title":"ETS2/ATS"},"/docs/ets2_ats/ets2-qjti/":{"data":{"":"","changes#Changes":"","download#Download":"ETS2-QJTI (short for Euro Truck Simulator 2 Quick Job Truck Improvements), as its name suggest, aims to improve some Quick Job truck configurations for Euro Truck Simulator 2.\nChanges DAF NGD Replaced original 4×2 heavy/oversize configs with 6×4 XG+ config (2021) Added 6×4 and 8×4 configs for XFC and XG+ (2021 and 2025) These configurations are also available at any DAF dealer or the Mod Dealer.\nDAF XD Replaced original 4×2 heavy/oversize configs with 6×4 XDC config (2021) Added new 2025 6×4 heavy/oversize config These configurations are also available at any DAF dealer or the Mod Dealer.\nDAF XF Euro 6 Pre-existing configs now use facelift interiors if they didn’t already Added 2012 configs based on the originals The 2012 configurations will appear in the Used Dealer at random.\nIveco S-Way Configs that originally used metallic paintjobs now use solid ones Volvo FH6 Added new 6×4 heavy/oversize configs (standard front only) The FH6 does not feature custom beacon options like the New Gen DAFs do. In their place, the heavy config uses the “Bonfire” beacon from the base game, and the oversize config uses the “Star” beacon from the Special Transport DLC.\nThis configuration is also available at any Volvo dealer or the Mod Dealer.\nDownload TruckyMods"},"title":"ETS2-QJTI"},"/docs/guides/setattribute/":{"data":{"":"This guide shows you how to set an attribute for any Roblox instance. Beginning with PVC’s MT4 series, this method has been adopted for changing alarm parameters such as tone and strobe intensity (some models only), instead of using the traditional method of havivng all parameters defined in a script. This allows developers to more easily make use of services like CollectionService, if necessary, while maintaining individuality between multiple alarms.","assumptions#Assumptions":"This guide assumes you are not enrolled in the Next Generation Studio Preview beta, but if you are, the instructions here should be mostly similar.","prerequisites#Prerequisites":"You will need:\nRoblox Studio Object Explorer panel Properties panel Already have these? Skip to the main section.","steps#Steps":" Toggle the Object Explorer panel On the ribbon, in the View group, click the Explorer button. Alternatively, you can press Alt+X (Windows) or Option+X (macOS).\nToggle the Properties panel On the ribbon, in the View group, click the Properties button.\nSetting an attribute Select the desired instance in the viewport or the Object Explorer. The instance’s properties appear in the Properties panel. If necessary, scroll down to the Attributes section. Set the desired attributes."},"title":"Setting an attribute"},"/docs/roblox/":{"data":{"":"All PVC assets for the Roblox platform.","fire-alarms#Fire alarms":" Wheelock Exceder LED3 Wheelock Exceder Xenon System Sensor L-Series Simplex TrueAlert SmartSync Wheelock MT4 ","furniture#Furniture":" Lounge Chairs Flourish II Apex! Desks (Unsupported) Legacy ","misc#Misc":"WIP"},"title":"Roblox"},"/docs/roblox/fire_alarms/":{"data":{"":" Wheelock Exceder LED3 Wheelock Exceder Xenon System Sensor L-Series Simplex TrueAlert SmartSync Wheelock MT4 "},"title":"Fire Alarms"},"/docs/roblox/fire_alarms/exceder_led3/":{"data":{"":"\nThe Wheelock Exceder LED3 collection is PVC’s very first – and largest. It was first released in January 2019, with a remastered version releasing in 2021, consisting of completely remodeled wall-mount devices among other updates. Not to mention lower poly count – that’s always nice!\nThese alarms were tested with moneyLAB’s RSA2000 system and should also be compatible with other systems based on that standard.\nRoblox Creator Store Ko-fi Shop ","contents#Contents":"A total of 106 devices are included.\nFire Red White LHSR3 – wall-mount combination horn/strobe LHSRC3 – ceiling-mount combination horn/strobe LSTR3 – wall-mount strobe LSTRC3 – ceiling-mount strobe LSPKR – wall-mount speaker LSPSTR3 – wall-mount combination speaker/strobe LSPSTRC3 – ceiling-mount combination speaker/strobe LFHNKR3 – wall-mount low-frequency sounder LFHSKR3 – wall-mount combination low-frequency sounder/110 cd strobe LFHSHR3 – wall-mount combination low-frequency sounder/177 cd strobe LHSW3 – wall-mount combination horn/strobe LHSWC3 – ceiling-mount combination horn/strobe LSTW3 – wall-mount strobe LSTWC3 – ceiling-mount strobe LSPKW – wall-mount speaker LSPSTW3 – wall-mount combination speaker/strobe LSPSTWC3 – ceiling-mount combination speaker/strobe LFHNKW3 – wall-mount low-frequency sounder LFHSKW3 – wall-mount combination low-frequency sounder/110 cd strobe LFHSHW3 – wall-mount combination low-frequency sounder/177 cd strobe General notification Red; plain White; plain Red; ALERT White; ALERT LHNR3 – wall-mount horn LHNRC3 – ceiling-mount horn LHSR3-N – wall-mount combination horn/strobe LHSRC3-N – ceiling-mount combination horn/strobe LHSRC3-NA – with amber lens LHSRC3-NB – with blue lens LSTR3-N – wall-mount strobe LSTR3-NA – with amber lens LSTR3-NB – with blue lens LSTRC3-N – ceiling-mount strobe LSTRC3-NA – with amber lens LSTRC3-NB – with blue lens LSPKR-N – wall-mount speaker LSPKRC – ceiling-mount speaker LSPSTR3-N – wall-mount combination speaker/strobe LSPSTR3-NA – with amber lens LSPSTR3-NB – with blue lens LSPSTRC3-N – ceiling-mount combination speaker/strobe LSPSTRC3-NA – with amber lens LSPSTRC3-NB – with blue lens LFHNKR3-N – wall-mount low-frequency sounder LFHSKR3-N – wall-mount combination low-frequency sounder/110 cd strobe LFHSHR3-N – wall-mount combination low-frequency sounder/177 cd strobe LHNW3 – wall-mount horn LHNWC3 – ceiling-mount horn LHSW3-N – wall-mount combination horn/strobe LHSWC3-N – ceiling-mount combination horn/strobe LHSWC3-NA – with amber lens LHSWC3-NB – with blue lens LSTW3-N – wall-mount strobe LSTW3-NA – with amber lens LSTW3-NB – with blue lens LSTWC3-N – ceiling-mount strobe LSTWC3-NA – with amber lens LSTWC3-NB – with blue lens LSPKW-N – wall-mount speaker LSPKWC – ceiling-mount speaker LSPSTW3-N – wall-mount combination speaker/strobe LSPSTW3-NA – with amber lens LSPSTW3-NB – with blue lens LSPSTWC3-N – ceiling-mount combination speaker/strobe LSPSTWC3-NA – with amber lens LSPSTWC3-NB – with blue lens LFHNKW3-N – wall-mount low-frequency sounder LFHSKW3-N – wall-mount combination low-frequency sounder/110 cd strobe LFHSHW3-N – wall-mount combination low-frequency sounder/177 cd strobe LHSR3-AL – wall-mount combination horn/strobe LHSRC3-AL – ceiling-mount combination horn/strobe LHSRC3-ALA – with amber lens LHSRC3-ALB – with blue lens LSTR3-AL – wall-mount strobe LSTR3-ALA – with amber lens LSTR3-ALB – with blue lens LSTRC3-AL – ceiling-mount strobe LSTRC3-ALA – with amber lens LSTRC3-ALB – with blue lens LSPKR-AL – wall-mount speaker LSPSTR3-AL – wall-mount combination speaker/strobe LSPSTR3-ALA – with amber lens LSPSTR3-ALB – with blue lens LSPSTRC3-AL – ceiling-mount combination speaker/strobe LSPSTRC3-ALA – with amber lens LSPSTRC3-ALB – with blue lens LFHNKR3-AL – wall-mount low-frequency sounder LFHSKR3-AL – wall-mount combination low-frequency sounder/110 cd strobe LFHSHR3-AL – wall-mount combination low-frequency sounder/177 cd strobe LHSW3-AL – wall-mount combination horn/strobe LHSWC3-AL – ceiling-mount combination horn/strobe LHSWC3-ALA – with amber lens LHSWC3-ALB – with blue lens LSTW3-AL – wall-mount strobe LSTW3-ALA – with amber lens LSTW3-ALB – with blue lens LSTWC3-AL – ceiling-mount strobe LSTWC3-ALA – with amber lens LSTWC3-ALB – with blue lens LSPKW-AL – wall-mount speaker LSPSTW3-AL – wall-mount combination speaker/strobe LSPSTW3-ALA – with amber lens LSPSTW3-ALB – with blue lens LSPSTWC3-AL – ceiling-mount combination speaker/strobe LSPSTWC3-ALA – with amber lens LSPSTWC3-ALB – with blue lens LFHNKW3-AL – wall-mount low-frequency sounder LFHSKW3-AL – wall-mount combination low-frequency sounder/110 cd strobe LFHSHW3-AL – wall-mount combination low-frequency sounder/177 cd strobe ","details#Details":" First release (overall): Release Candidate 1 (19 January 2019) First release (PVC): 21.11 (2 November 2021) Latest release: 22.03 (4 March 2022) ","known-issues#Known issues":" Strobes will only flash once on continuous visual circuits. "},"title":"Exceder LED3"},"/docs/roblox/fire_alarms/exceder_xe/":{"data":{"":"The Wheelock Exceder Xenon collection was first released in mid-2019, with a remastered version releasing in 2022, consisting of heavily facelifted wall-mount devices. If only you could see how awful and bloated they were prior…\nThese alarms were tested with moneyLAB’s RSA2000 system and should also be compatible with other systems based on that standard.\nRoblox Creator Store Ko-fi Shop ","changelog#Changelog":"Version 25.01 (17 January 2025) Click me to reveal Fixed an issue where strobes would only flash once on continuous visual circuits Upgraded all models to use Attributes (excl. HN/HNC) Not super important but… the models are a bit closer together now Removed skybox from Ko-fi release Version 23.01 (11 January 2023) Click me to reveal Cleaned up wall-mount lens geometry. This also fixes bulging in certain areas. Version 22.08 (19 August 2022) Click me to reveal Facelifted wall-mount models (lenses are completely new). The updated models feature more accurate and natural curvature and also cut down on unnecessary polygons. Red labels are brighter in color Thinner rubber seams for all backboxes Lighting effects optimized for Future is Bright: Phase 3 60 cd intensity option added for STWC-N. Sorry for missing it with the June 2021 update - thank you themasoners for catching this bug! Version 21.12 (24 December 2021) Click me to reveal All instances of wait() replaced with task.wait() Tagged all appliances with release code; please preserve this! Version 21.06 (19 June 2021) Click me to reveal Migrated collection to a group. The model under PenguinRescue1sAlt will no longer receive support or updates and will eventually be taken off sale. Discontinued release candidate system. What was the point? 60 cd intensity option is now available for ALL ceiling-mount devices. Prior to this release, the option was only available for colored-lens devices. Gorgeous new thumbnail designed by yours truly Release Candidate 2 (27 November 2019) Click me to reveal Decided to skip RC1β and go straight to RC2 as this release contains 31 additional appliances. Release Candidate 1α (31 July 2019) Click me to reveal First version ever released to the public. 12 alarms are included in RC1α. More will be included in RC1β. ","contents#Contents":"A total of 43 devices are included in this collection. This is one of two PVC fire alarm collections to feature an odd number of devices, the other being the MT4 (5).\nFire Red HSR – wall-mount combination horn/strobe with FIRE lettering STR – wall-mount strobe with FIRE lettering HSRC – ceiling-mount combination horn/strobe with FIRE lettering STRC – ceiling-mount strobe with FIRE lettering White HSW – wall-mount combination horn/strobe with FIRE lettering STW – wall-mount strobe with FIRE lettering HSWC – ceiling-mount combination horn/strobe with FIRE lettering STWC – ceiling-mount strobe with FIRE lettering Plain Red HNR – wall-mount horn HSR-N – wall-mount combination horn/strobe STR-N – wall-mount strobe STR-NA – with amber lens STR-NB – with blue lens STR-NG – with green lens STR-NR – with red lens HNRC – ceiling mount horn HSRC-N – ceiling-mount combination horn/strobe STRC-N – ceiling-mount strobe STRC-NA – with amber lens STRC-NB – with blue lens STRC-NG – with green lens STRC-NR – with red lens White HNW – wall-mount horn HSW-N – wall-mount combination horn/strobe STW-N – wall-mount strobe STW-NA – with amber lens STW-NB – with blue lens STW-NG – with green lens STW-NR – with red lens HNWC – ceiling mount horn HSWC-N – ceiling-mount combination horn/strobe STWC-N – ceiling-mount strobe STWC-NA – with amber lens STWC-NB – with blue lens STWC-NG – with green lens STWC-NR – with red lens General notification Red STR-AL – wall-mount strobe with ALERT lettering STR-ALA – with amber lens STRC-AL – ceiling-mount stobe with ALERT lettering White STW-AL – wall-mount strobe with ALERT lettering STW-ALA – with amber lens STWC-AL – ceiling-mount stobe with ALERT lettering STWC-ALA – with amber lens ","details#Details":" First release (overall): Release Candidate 1α (31 July 2019) First release (PVC): 21.06 (19 June 2021) Latest release: 25.01 (17 January 2025) ","known-issues#Known issues":" None "},"title":"Exceder Xenon"},"/docs/roblox/fire_alarms/lseries/":{"data":{"":"","contents#Contents":"","details#Details":"","known-issues#Known issues":"\nThe System Sensor L-Series collection is PVC’s most popular. It was first released in October 2019. The collection contains 58 devices.\nThese alarms were tested with moneyLAB’s RSA2000 system and should also be compatible with other systems based on that standard.\nRoblox Creator Store\rKo-fi Shop\rDetails First release (overall): Alpha 1 (25 October 2019) First release (PVC): 21.07 (1 July 2021) Latest release: 24.07 (5 July 2024) Contents A total of 58 wall- and ceiling-mounted, indoor-rated alarm appliances are included, for both fire and general notification use.\nFire Red White P2RL – full-width wall-mount combination horn/strobe with FIRE lettering P2GRL – single-gang wall-mount combination horn/strobe with FIRE lettering PC2RL – ceiling-mount combination horn/strobe with FIRE lettering P2RL-LF – full-width wall-mount combination 520 Hz sounder/strobe with FIRE lettering SRL – full-width wall-mount strobe with FIRE lettering SGRL – single-gang wall-mount strobe with FIRE lettering SCRL – ceiling-mount strobe with FIRE lettering SPSRL – wall-mount combination speaker/strobe with FIRE lettering SPSCRL – ceiling-mount combination speaker/strobe with FIRE lettering P2WL – full-width wall-mount combination horn/strobe with FIRE lettering P2GWL – single-gang wall-mount combination horn/strobe with FIRE lettering PC2WL – ceiling-mount combination horn/strobe with FIRE lettering P2WL-LF – full-width wall-mount combination 520 Hz sounder/strobe with FIRE lettering SWL – full-width wall-mount strobe with FIRE lettering SGWL – single-gang wall-mount strobe with FIRE lettering SCWL – ceiling-mount strobe with FIRE lettering SPSWL – wall-mount combination speaker/strobe with FIRE lettering SPSCWL – ceiling-mount combination speaker/strobe with FIRE lettering Fuego (Spanish) Red White P2RL-SP – full-width wall-mount combination horn/strobe with FUEGO lettering P2GRL-SP – single-gang wall-mount combination horn/strobe with FUEGO lettering SRL-SP – full-width wall-mount strobe with FUEGO lettering SGRL-SP – single-gang wall-mount strobe with FUEGO lettering SPSRL-SP – wall-mount combination speaker/strobe with FUEGO lettering P2WL-SP – full-width wall-mount combination horn/strobe with FUEGO lettering P2GWL-SP – single-gang wall-mount combination horn/strobe with FUEGO lettering SWL-SP – full-width wall-mount strobe with FUEGO lettering SGWL-SP – single-gang wall-mount strobe with FUEGO lettering SPSWL-SP – wall-mount combination speaker/strobe with FUEGO lettering Unmarked The label parts weren’t removed from these models, allowing you to easily add labels to them if you wish.\nRed White CHRL – full-width wall-mount chime CHSRL – full-width wall-mount combination chime/strobe CHSCRL – ceiling-mount combination chime/strobe HRL – full-width wall-mount horn HGRL – single-gang wall-mount horn P2RL-P – full-width wall-mount combination horn/strobe PC2RL-P – ceiling-mount combination horn/strobe SRL-P – full-width wall-mount strobe SCRL-P – ceiling-mount strobe SPRL – wall-mount speaker SPSRL-P – wall-mount combination speaker/strobe SPSCRL-P – ceiling mount combination speaker/strobe CHWL – full-width wall-mount chime CHSWL – full-width wall-mount combination chime/strobe CHSCWL – ceiling-mount combination chime/strobe HWL – full-width wall-mount horn HGWL – single-gang wall-mount horn P2WL-P – full-width wall-mount combination horn/strobe PC2WL-P – ceiling-mount combination horn/strobe SWL-P – full-width wall-mount strobe SCWL-P – ceiling-mount strobe SPWL – wall-mount speaker SPSWL-P – wall-mount combination speaker/strobe SPSCWL-P – ceiling mount combination speaker/strobe General notification (the colored strobes and stuff)\nSWL-ALERT – full-width wall-mount strobe with amber lens and ALERT lettering SWL-CLR-ALERT – full-width wall-mount strobe with clear lens and ALERT lettering SCWL-CLR-ALERT – ceiling-mount strobe with clear lens and ALERT lettering SPSWL-ALERT – wall-mount combination speaker/strobe with amber lens and ALERT lettering SPSWL-CLR-ALERT – wall-mount combination speaker/strobe with clear lens and ALERT lettering SPSWL-CLR-ALERT – ceiling-mount combination speaker/strobe with clear lens and ALERT lettering Known issues None "},"title":"L-Series"},"/docs/roblox/fire_alarms/mt4/":{"data":{"":"","contents#Contents":"","details#Details":"","known-issues#Known issues":"The Wheelock MT4 collection is PVC’s most recent, having first been released on 24 April 2024. The collection contains 5 devices. If you want to be more technical, it contains 7, as one device combines three models.\nThese alarms were tested with moneyLAB’s RSA2000 system and should also be compatible with other systems based on that standard.\nRoblox Creator Store\rKo-fi Shop\rDetails First release: 24.04 (24 April 2024) Latest release: 24.08 (4 August 2024) Strobe intensities Strobe type Intensity WH, LS 15 cd MS 30 cd IS 75 cd Contents A total of five wall-mount devices are included.\nMT4-115-R – red horn MT4-115-S – silver horn MT4-115-WH-VFR – red horn + white 15cd strobe with FIRE lettering MT4-115-WH-VNS – silver horn + white 15cd unlettered strobe MT4-24-LS/MS/IS-VFR – red horn + UL 1971-compliant 15/30/75cd strobe with FIRE lettering Known issues None ","strobe-intensities#Strobe intensities":""},"title":"MT4"},"/docs/roblox/fire_alarms/truealert/":{"data":{"":"The Simplex TrueAlert SmartSync collection is PVC’s first new collection in almost four years!\nThese alarms were tested with moneyLAB’s RSA2000 system and should also be compatible with other systems based on that standard.\nIMPORTANT: With Release 25.02, these alarms now use CollectionService. As such, their scripts have been extensively restructured in a way that means that alarms no longer have individual scripts. All alarms are now controlled by the scripts in the “!Scripts_PVC_P10” folder. I recommend you place this folder to ServerScriptService, but because the alarms have no module calls – for which individual scripts are needed – this is by no means essential.\nRoblox Creator Store Ko-fi Shop ","changelog#Changelog":"Version 25.02 (1 February 2025) Click me to reveal Updated all models to use CollectionService. This will make things easier for you AND me! New attribute entitled “ContVisualCircuit” (boolean). Set to TRUE for strobe to flash continuously or FALSE for the strobe to flash if VisualCircuit is set to 1. 6 new models: 4906-9105/-9106/-9113 weatherproof strobes 4906-9131/-9132/-9143 weatherproof horn strobes Version 24.12 (7 December 2024) Click me to reveal 2 new models: 4902-9210/-9211 chimes More detailed horn and speaker models. They should look better without ambient occlusion enabled… and maybe with, too. Upgraded all models to use Attributes (excl. 9820s) Label improvements! All models now feature make/model labels, and all labels now follow the curve of the alarms. Fixed an issue where strobes would only flash once with continuous visual circuits Version 23.07 (4 July 2023) Click me to reveal First version released to the public. Happy fourth of July! ","contents#Contents":"The pack contains 24 wall-mount devices.\nRed White 4901-9820 with 4905-9988 cover – horn 4902-9210 – chime 4902-9716 – speaker 4906-9101 – strobe, regular intensity 4906-9105 – outdoor strobe, UL intensities 4906-9109 – strobe, high intensity 4906-9113 - outdoor strobe, ULC intensities 4906-9127 – combination horn/strobe, regular intensity 4906-9131 – outdoor combination horn/strobe, UL intensities 4906-9133 – chime/strobe, regular intensity 4906-9139 – combination horn/strobe, high intensity 4906-9143 – outdoor combination horn/strobe, ULC intensities 4906-9151 – combination speaker/strobe, regular intensity 4901-9820 with 4905-9989 cover – horn 4902-9211 – chime 4902-9717 – speaker 4906-9103 – strobe, regular intensity 4906-9106 – outdoor strobe, UL intensities 4906-9111 – strobe, high intensity 4906-9129 – combination horn/strobe, regular intensity 4906-9132 – outdoor combination horn/strobe, UL intensities 4906-9134 – combination chime/strobe, regular intensity 4906-9141 – combination horn/strobe, high intensity 4906-9153 – combination speaker/strobe, regular intensity ","details#Details":" First release: 23.07 (4 July 2023) Latest release: 25.02 (1 February 2025) ","known-issues#Known issues":" None ","strobe-intensities#Strobe intensities":" Strobe type Options Models Regular intensity 15/30/75/110 cd 9101, 9103, 9127, 9129, 9133, 9134, 9151, 9153 High intensity 135/177/185 cd 9109, 9111, 9139, 9141 Outdoor intensities (UL) 15/60/75 cd 9105, 9106, 9131, 9132 Outdoor intensities (ULC) 5/20/30 cd 9113, 9143 "},"title":"TrueAlert"},"/docs/roblox/furniture/":{"data":{"":" Lounge Chairs Flourish II Apex! Desks (Unsupported) Legacy "},"title":"Furniture"},"/docs/roblox/furniture/apex_desks/":{"data":{"":"Apex – a desk set designed to complement the Flourish II chairs.\nI started working on Apex in early 2023 and released in the middle of that year.\nLargely inspired by the Silhouette series by Smith System, Apex features three book box options, two height options, two width options, and two surface options. All versions are also height-adjustable, although they can only be adjusted in Studio for the time being. Since Release 23.09, all versions of Apex support the use of SurfaceAppearance.\nRoblox Creator Store Ko-fi Shop ","contents#Contents":"A total of 24 desks are available.","details#Details":" First release: 23.06 (18 June 2023) Latest release: 23.09 (10 September 2023) ","known-issues#Known issues":" None "},"title":"Apex! Desks"},"/docs/roblox/furniture/flourish_2/":{"data":{"":"Flourish II – also known as Flourish 2, Flourish Series 2, or Flourish Deux – the successor to the legendary Flourish collection first introduced in early 2015 (15 March 2015 to be exact). Its release date was not coincidental.\nI had worked on Flourish II sporadically between August 2022 and May 2023 (lack of time :P), and while I think the original Flourish series aged quite well for an 8-year-old design – better than a lot of my older (and even some newer) furniture designs – but after a while, I felt it was time for its successor.\nThe original Flourish was heavily inspired by Artcobell’s Alphabet and HON’s SmartLink lines, but Flourish II additionally takes inspiration from Virco’s Civitas frame, which is used on the manufacturer’s Analogy, Sage and ZUMA lines.\nRoblox Creator Store Ko-fi Shop ","changelog#Changelog":"Version 24.09b (2 October 2024) Slightly adjusted legs for caster variants for consistency Version 24.09a (25 September 2024) Slightly adjusted caster model to be smoother Version 24.09 (15 September 2024) Added three new models, with or without cushions (total 6): 4-leg chair with casters 4-leg stool (Flourish I/Virco Civitas-style) with casters 4-leg stool (HON SmartLink-style) with casters Fixed some instance names for consistency Version 23.05 (13 May 2023) First version to be released to the public. Includes five frame options, with or without cushions (total 10): 4-leg chair with glides Cantilever chair Sled-base chair 4-leg stool (Flourish I/Virco Civitas-style) with glides 4-leg stool (HON SmartLink style) with glides ","contents#Contents":"A total of 16 chairs are available.","details#Details":" First release: 23.05 (13 May 2023) Latest release: 24.09b (2 October 2024) ","gallery#Gallery":" Cantilever Four-Leg Sled Stool 1 Stool 2 ","known-issues#Known issues":" None "},"title":"Flourish II"},"/docs/roblox/furniture/legacy_seet/":{"data":{"":" ⚠️ The following items are considered unsupported and thus will not receive any updates. If you receive a pop-up regarding the chairs having scripts, this is generally because they use a script to compensate for an ages-old issue with anchored Seats (the Roblox instance); these also lack support for R15. The issues with anchored seats have been resolved for several years. You are free to use them in your projects, although better options exist. All legacy SEET products.","brillia#Brillia":"Released in 2015, facelifted in December 2017 (or was it January 2018?) with Brillia Series 1.5. An upholstered variant was also introduced then.\nNo R15 support for Series 1","consolidate#Consolidate":"Released in 2015.","enrich#Enrich":"Huh? Released in 2015.\nNo R15 support","excel#Excel":"Chairs inspired by Allsteel’s Take-5 line. Released in 2015.\nNo R15 support","explore#Explore":"Inspired by Artcobell’s Discover series. Not very good. Released in 2015.\nNo R15 support","flourish-i#Flourish I":"The venerable Flourish legacy series has cemented itself as SEET’s quintessential product line (i.e. the one that’s held up better than the rest). First released in 2015 with further variants being released up to 2018.","hoist#Hoist":"Released in 2014(?)\nNo R15 support","impact#Impact":"The de-facto replacement for Intent. Released December 2017.","intent#Intent":"Seemingly abstract block arrangements that don’t seem to have done too well. Released January 2017.","nova#Nova":"Chairs inspired by Allsteel’s Seek line. I tried to be very quirky, which ultimately led to the failure of the first generation released in 2015. A second generation, dubbed Nova2, was released in 2017.\nNo R15 support for Nova 1"},"title":"Legacy SEET"},"/docs/roblox/furniture/lounge_chairs/":{"data":{"":"A collection of lounge chairs I made in about five hours. They are heavily based on HON’s Grove series and designed with an emphasis on color customization and modularity. There are four versions: single seat, double seat, double seat with middle table, and triple seat. All versions come in three arm styles: no arms, square arms, and tapered arms.\nRoblox Creator Store Ko-fi Shop ","changelog#Changelog":"Version 22.10 released 9 October 2022\nFirst version to be released to the public. Includes four seat styles with three arm options (total 12) Seat options One-person seat Two-person seat Three-person seat Two-person seat with intermediate table Arm options No arms Square arms Tapered arms ","contents#Contents":"A total of 12 chairs are available.","details#Details":" First release: 22.10 (9 October 2022) Latest release: 22.10 (9 October 2022) ","known-issues#Known issues":" None "},"title":"Lounge chairs"},"/links/":{"data":{"":"","links#Links":""},"title":"Links"},"/privacy/":{"data":{"":"Most terms of service and privacy policies are extremely long passages of Legalese, which is pretty much incomprehensible to anyone who’s not a lawyer – or ChatGPT. This privacy policy is not that.","information-collected-by-pv-creations#Information collected by PV Creations":"PV Creations only collects website-related data through emails sent to its email address: pv.creations.rbx@gmail.com. Collected data will be used to improve the site.","information-collected-by-this-site#Information collected by this site":"This website, in and of itself, does not collect any data."},"title":"Privacy Policy"}}