{"/blog/a/":{"data":{"":"","test-blog#Test blog":"This is a test blog post"},"title":"A"},"/docs/":{"data":{"":"","if-nothings-showing-up-on-the-left#If nothing\u0026rsquo;s showing up on the left\u0026hellip;":"Just about every PV Creations asset.\nIf nothing’s showing up on the left… Don’t panic. It probably wasn’t published yet. This is a work in progress, after all. Or maybe I don’t know how this Hugo thing works."},"title":"Asset Documentation"},"/docs/ets2_ats/":{"data":{"":"All ETS2 and ATS mods by PV Creations. They’re not very big, mind you."},"title":"ETS2/ATS"},"/docs/roblox/":{"data":{"":"All PVC assets for the Roblox platform.","fire-alarms#Fire alarms":" Wheelock Exceder LED3 Wheelock Exceder Xenon System Sensor L-Series Simplex TrueAlert SmartSync Wheelock MT4 ","furniture#Furniture":"WIP","misc#Misc":"WIP"},"title":"Roblox"},"/docs/roblox/fire_alarms/":{"data":{"":" Wheelock Exceder LED3 Wheelock Exceder Xenon System Sensor L-Series Simplex TrueAlert SmartSync Wheelock MT4 "},"title":"Fire Alarms"},"/docs/roblox/fire_alarms/exceder_led3/":{"data":{"":"The Wheelock Exceder LED3 collection is PVC’s very first – and largest. It was first released in January 2019, with a remastered version releasing in 2021, consisting of completely remodeled wall-mount devices among other updates. Not to mention lower poly count – that’s always nice!\nThese alarms were tested with moneyLAB’s RSA2000 system and should also be compatible with other systems based on that standard.\nRoblox Creator Store Ko-fi Shop ","contents#Contents":"Fire Plain General notification ","details#Details":" First release (overall): Release Candidate 1 (19 January 2019) First release (PVC): 21.11 (2 November 2021) Latest release: 22.03 (4 March 2022) ","known-issues#Known issues":" (applies to all alarms excluding the MT4 pack) Strobes will only flash once if the parent NAC’s VisualCoding is set to 0 or continuous. "},"title":"Exceder LED3"},"/docs/roblox/fire_alarms/exceder_xe/":{"data":{"":"The Wheelock Exceder Xenon collection was first released in mid-2019, with a remastered version releasing in 2022, consisting of heavily facelifted wall-mount devices. If only you could see how awful and bloated they were prior…\nFun fact: This is one of two PVC fire alarm collections to feature an odd number of devices (43), the other being the MT4 (5).\nThese alarms were tested with moneyLAB’s RSA2000 system and should also be compatible with other systems based on that standard.\nRoblox Creator Store Ko-fi Shop ","contents#Contents":"Fire Red HSR – wall-mount combination horn/strobe with FIRE lettering STR – wall-mount strobe with FIRE lettering HSRC – ceiling-mount combination horn/strobe with FIRE lettering STRC – ceiling-mount strobe with FIRE lettering White HSW – wall-mount combination horn/strobe with FIRE lettering STW – wall-mount strobe with FIRE lettering HSWC – ceiling-mount combination horn/strobe with FIRE lettering STWC – ceiling-mount strobe with FIRE lettering Plain Red HNR – wall-mount horn HNRC – ceiling mount horn White HNW – wall-mount horn HNWC – ceiling mount horn General notification ","details#Details":" First release (overall): Release Candidate 1 (31 July 2019) First release (PVC): 21.06 (19 June 2021) Latest release: 23.01 (11 January 2023) ","known-issues#Known issues":" (applies to all alarms excluding the MT4 pack) Strobes will only flash once if the parent NAC’s VisualCoding is set to 0 or continuous. "},"title":"Exceder Xenon"},"/docs/roblox/fire_alarms/lseries/":{"data":{"":"","contents#Contents":"","details#Details":"","known-issues#Known issues":"The System Sensor L-Series collection is PVC’s most popular. It was first released in October 2019. The collection contains 48 devices.\nThese alarms were tested with moneyLAB’s RSA2000 system and should also be compatible with other systems based on that standard.\nRoblox Creator Store\rKo-fi Shop\rDetails First release (overall): Alpha 1 (25 October 2019) First release (PVC): 21.07 (1 July 2021) Latest release: 24.01 (24 January 2024) Contents A total of 48 wall- and ceiling-mounted, indoor-rated alarm appliances are included, for both fire and general notification use.\nFire Red P2RL – full-width wall-mount combination horn/strobe with FIRE lettering P2GRL – single-gang wall-mount combination horn/strobe with FIRE lettering PC2RL – ceiling-mount combination horn/strobe with FIRE lettering P2RL-LF – full-width wall-mount combination 520 Hz sounder/strobe with FIRE lettering SRL – full-width wall-mount strobe with FIRE lettering SGRL – single-gang wall-mount strobe with FIRE lettering SCRL – ceiling-mount strobe with FIRE lettering SPSRL – wall-mount combination speaker/strobe with FIRE lettering SPSCRL – ceiling-mount combination speaker/strobe with FIRE lettering White P2WL – full-width wall-mount combination horn/strobe with FIRE lettering P2GWL – single-gang wall-mount combination horn/strobe with FIRE lettering PC2WL – ceiling-mount combination horn/strobe with FIRE lettering P2WL-LF – full-width wall-mount combination 520 Hz sounder/strobe with FIRE lettering SWL – full-width wall-mount strobe with FIRE lettering SGWL – single-gang wall-mount strobe with FIRE lettering SCWL – ceiling-mount strobe with FIRE lettering SPSWL – wall-mount combination speaker/strobe with FIRE lettering SPSCWL – ceiling-mount combination speaker/strobe with FIRE lettering Unmarked While not having label decals, the label parts weren’t removed, allowing you to easily add labels to them if you want.\nRed CHRL – full-width wall-mount chime CHSRL – full-width wall-mount combination chime/strobe CHSCRL – ceiling-mount combination chime/strobe HRL – full-width wall-mount horn HGRL – single-gang wall-mount horn P2RL-P – full-width wall-mount combination horn/strobe PC2RL-P – ceiling-mount combination horn/strobe SRL-P – full-width wall-mount strobe SCRL-P – ceiling-mount strobe SPRL – wall-mount speaker SPSRL-P – wall-mount combination speaker/strobe SPSCRL-P – ceiling mount combination speaker/strobe White CHWL – full-width wall-mount chime CHSWL – full-width wall-mount combination chime/strobe CHSCWL – ceiling-mount combination chime/strobe HWL – full-width wall-mount horn HGWL – single-gang wall-mount horn P2WL-P – full-width wall-mount combination horn/strobe PC2WL-P – ceiling-mount combination horn/strobe SWL-P – full-width wall-mount strobe SCWL-P – ceiling-mount strobe SPWL – wall-mount speaker SPSWL-P – wall-mount combination speaker/strobe SPSCWL-P – ceiling mount combination speaker/strobe General notification (the colored strobes and stuff)\nSWL-ALERT – full-width wall-mount strobe with amber lens and ALERT lettering SWL-CLR-ALERT – full-width wall-mount strobe with clear lens and ALERT lettering SCWL-CLR-ALERT – ceiling-mount strobe with clear lens and ALERT lettering SPSWL-ALERT – wall-mount combination speaker/strobe with amber lens and ALERT lettering SPSWL-CLR-ALERT – wall-mount combination speaker/strobe with clear lens and ALERT lettering SPSWL-CLR-ALERT – ceiling-mount combination speaker/strobe with clear lens and ALERT lettering Known issues (applies to all alarms excluding the MT4 pack) Strobes will only flash once if the parent NAC’s VisualCoding is set to 0 or continuous. "},"title":"L-Series"},"/docs/roblox/fire_alarms/mt4/":{"data":{"":"","contents#Contents":"","details#Details":"","known-issues#Known issues":"The Wheelock MT4 collection is PVC’s most recent, having first been released on 24 April 2024. The collection contains 5 devices. If you want to be more technical, it contains 7, as one device combines three models.\nThese alarms were tested with moneyLAB’s RSA2000 system and should also be compatible with other systems based on that standard.\nRoblox Creator Store\rKo-fi Shop\rDetails First release: 24.04 (24 April 2024) Latest release: 24.05 (27 May 2024) Contents A total of five wall-mount devices are included.\nMT4-115-R – red horn MT4-115-S – silver horn MT4-115-WH-VFR – red horn + white 15cd strobe with FIRE lettering MT4-115-WH-VNS – silver horn + white 15cd unlettered strobe MT4-24-LS/MS/IS-VFR – red horn + UL 1971-compliant 15/30/75cd strobe with FIRE lettering Known issues None "},"title":"MT4"},"/docs/roblox/fire_alarms/truealert/":{"data":{"":"The Simplex TrueAlert SmartSync collection is PVC’s first new collection in almost four years!\nThese alarms were tested with moneyLAB’s RSA2000 system and should also be compatible with other systems based on that standard.\nRoblox Creator Store Ko-fi Shop ","contents#Contents":"The pack contains sixteen wall-mount devices. High-intensity models feature 135/177/185 cd strobe options, whereas regular-intensity models feature 15/30/75/110 cd strobe options.\nRed 4901-9820 – horn 4902-9716 – speaker 4906-9101 – strobe, regular intensity 4906-9109 – strobe, high intensity 4906-9127 – combination horn/strobe, regular intensity 4906-9139 – combination horn/strobe, high intensity 4906-9133 – combination chime/strobe, regular intensity 4906-9151 – combination speaker/strobe, regular intensity White 4901-9820 – horn 4902-9717 – speaker 4906-9103 – strobe, regular intensity 4906-9111 – strobe, high intensity 4906-9129 – combination horn/strobe, regular intensity 4906-9141 – combination horn/strobe, high intensity 4906-9134 – combination chime/strobe, regular intensity 4906-9153 – combination speaker/strobe, regular intensity ","details#Details":" First release: 23.07 (4 July 2023) Latest release: 23.07 (4 July 2023) ","known-issues#Known issues":" (applies to all alarms excluding the MT4 pack) Strobes will only flash once if the parent NAC’s VisualCoding is set to 0 or continuous. "},"title":"TrueAlert"},"/docs/roblox/furniture/":{"data":{"":" Lounge Chairs Flourish II Apex! Desks "},"title":"Furniture"},"/links/":{"data":{"":"","links#Links":""},"title":"Links"}}